LC2WithoutExtensionFilled/0/blueprints/waterlevel/alpha.water.1
    {
        type            waterLevel_alpha_prgh;  // Behaves like zeroGradient at an outlet and like a Dirichlet-BC at an inlet.
        mode            singleValue;            // singleValue, ratingCurveTable, ratingCurveFunction or timeSeries  
