LC2WithoutExtensionFilled/0/blueprints/waterlevel/p_rgh.1
    {
        type            waterLevel_alpha_prgh;
        mode            singleValue;            // singleValue, ratingCurveTable, ratingCurveFunction or timeSeries  
